CREATE TABLE appointments_temp ("oid" TEXT, "start" TEXT, "from" text);
CREATE TABLE appointments_temp_2 ("oid" TEXT, "start" TEXT, "from" text);

CREATE INDEX appointments_temp_oid ON appointments_temp ("oid");
CREATE INDEX appointments_temp_start ON appointments_temp ("start");

CREATE INDEX appointments_temp_2_oid ON appointments_temp_2 ("oid");
CREATE INDEX appointments_temp_2_start ON appointments_temp_2 ("start");

WITH orgs AS (
  SELECT id, resource
  FROM organization
  WHERE resource -> 'partOf' IS NULL)
--  WHERE identifier_value(resource, 'urn:identity:oid:Organization') IN ('1.2.643.5.1.13.13.12.2.21.1514','1.2.643.5.1.13.13.12.2.21.1515','1.2.643.5.1.13.13.12.2.21.1518','1.2.643.5.1.13.13.12.2.21.1563','1.2.643.5.1.13.13.12.2.21.1564','1.2.643.5.1.13.13.12.2.21.1556','1.2.643.5.1.13.13.12.2.21.1502','1.2.643.5.1.13.13.12.2.21.1505','1.2.643.5.1.13.13.12.2.21.1506','1.2.643.5.1.13.13.12.2.21.1509','1.2.643.5.1.13.13.12.2.21.1562','1.2.643.5.1.13.13.12.2.21.1555','1.2.643.5.1.13.13.12.2.21.1516','1.2.643.5.1.13.13.12.2.21.1559','1.2.643.5.1.13.13.12.2.21.10417'))
, appointments AS (
  SELECT o.resource org_resource
    , app.resource ->> 'start' "start"
    , app.resource ->> 'from' "from"
  FROM orgs o
    JOIN appointment app 
      ON app.resource ->> 'start' BETWEEN '2022-01-01' AND '2022-12-05'
     AND app.resource #>> '{mainOrganization,id}' = o.id
)
--SELECT *
--FROM appointments
INSERT INTO appointments_temp 
(SELECT identifier_value(org_resource, 'urn:identity:oid:Organization')
  , "start"
  , "from"
 FROM appointments)
 
WITH orgs AS (
  SELECT DISTINCT ON (prr.id)
    prr.id prr_id
    , o.resource org_resource
  FROM organization o
  JOIN practitionerrole prr ON prr.resource @@ logic_revinclude(o.resource, o.id, 'organization')
  WHERE o.resource @@ 'partOf = *'::jsquery)
--  WHERE identifier_value(o.resource, 'urn:identity:oid:Organization') IN ('1.2.643.5.1.13.13.12.2.21.1525.0.138194','1.2.643.5.1.13.13.12.2.21.1525.0.133590','1.2.643.5.1.13.13.12.2.21.1525.0.217012','1.2.643.5.1.13.13.12.2.21.1534.0.94875','1.2.643.5.1.13.13.12.2.21.1534.0.95731','1.2.643.5.1.13.13.12.2.21.1556.0.75666','1.2.643.5.1.13.13.12.2.21.1514.0.105884','1.2.643.5.1.13.13.12.2.21.1505.0.86619 ','1.2.643.5.1.13.13.12.2.21.1563.0.108254','1.2.643.5.1.13.13.12.2.21.1516.0.107664','1.2.643.5.1.13.13.12.2.21.1531.0.113590','1.2.643.5.1.13.13.12.2.21.1531.0.371682','1.2.643.5.1.13.13.12.2.21.1502.0.91570','1.2.643.5.1.13.13.12.2.21.1509.0.85728','1.2.643.5.1.13.13.12.2.21.1529.0.84540','1.2.643.5.1.13.13.12.2.21.1529.0.86519','1.2.643.5.1.13.13.12.2.21.1558.0.91831','1.2.643.5.1.13.13.12.2.21.1531.0.112838','1.2.643.5.1.13.13.12.2.21.1550.0.99123','1.2.643.5.1.13.13.12.2.21.1538.0.89487','1.2.643.5.1.13.13.12.2.21.1535.0.106932','1.2.643.5.1.13.13.12.2.21.1541.0.88460','1.2.643.5.1.13.13.12.2.21.1542.0.111436','1.2.643.5.1.13.13.12.2.21.1544.0.72362','1.2.643.5.1.13.13.12.2.21.1515.0.108694','1.2.643.5.1.13.13.12.2.21.1518.0.75379','1.2.643.5.1.13.13.12.2.21.1565.0.68991','1.2.643.5.1.13.13.12.2.21.1562.0.110709','1.2.643.5.1.13.13.12.2.21.1510.0.86450','1.2.643.5.1.13.13.12.2.21.1511.0.71866','1.2.643.5.1.13.13.12.2.21.1512.0.82541','1.2.643.5.1.13.13.12.2.21.1504.0.96242','1.2.643.5.1.13.13.12.2.21.1541.0.92194','1.2.643.5.1.13.13.12.2.21.1541.0.96371','1.2.643.5.1.13.13.12.2.21.1542.0.103529','1.2.643.5.1.13.13.12.2.21.1542.0.137160','1.2.643.5.1.13.13.12.2.21.1542.0.253753','1.2.643.5.1.13.13.12.2.21.1522.0.320039','1.2.643.5.1.13.13.12.2.21.1521.0.96376','1.2.643.5.1.13.13.12.2.21.1521.0.77641','1.2.643.5.1.13.13.12.2.21.1521.0.96385','1.2.643.5.1.13.13.12.2.21.1521.0.96394','1.2.643.5.1.13.13.12.2.21.1521.0.77798','1.2.643.5.1.13.13.12.2.21.1544.0.85293','1.2.643.5.1.13.13.12.2.21.1544.0.98163','1.2.643.5.1.13.13.12.2.21.1544.0.98271','1.2.643.5.1.13.13.12.2.21.1558.0.133425','1.2.643.5.1.13.13.12.2.21.1555.0.97744','1.2.643.5.1.13.13.12.2.21.1555.0.210693','1.2.643.5.1.13.13.12.2.21.1508.0.389946','1.2.643.5.1.13.13.12.2.21.1506.0.93889','1.2.643.5.1.13.13.12.2.21.1506.0.99372','1.2.643.5.1.13.13.12.2.21.1562.0.110419','1.2.643.5.1.13.13.12.2.21.1517.0.99457','1.2.643.5.1.13.13.12.2.21.1564.0.110271'))
, appointments AS (
  SELECT org_resource
    , app.resource ->> 'start' "start"
    , app.resource ->> 'from' "from"
  FROM orgs o
    JOIN appointment app
     ON (jsonb_path_query_first(resource, '$.participant.actor ? (@.resourceType=="PractitionerRole")') #>> '{id}') = prr_id
    AND (immutable_ts(resource->>'start')) BETWEEN '2022-01-01'::timestamp AND '2022-12-05'::timestamp
)
--SELECT *
--FROM appointments
INSERT INTO appointments_temp_2
(SELECT identifier_value(org_resource, 'urn:identity:oid:Organization')
  , "start"
  , "from"
 FROM appointments)

TRUNCATE appointments_temp;
TRUNCATE appointments_temp_2;

CREATE INDEX CONCURRENTLY appointment_doctor_start ON appointment
  ((jsonb_path_query_first(resource, '$.participant.actor ? (@.resourceType=="PractitionerRole")') #>> '{id}')
   , (immutable_ts(resource->>'start')))
 
ANALYZE appointment;   
   
-- A. без WHERE
-- Б.   WHERE "oid" IN ('1.2.643.5.1.13.13.12.2.21.1514','1.2.643.5.1.13.13.12.2.21.1515','1.2.643.5.1.13.13.12.2.21.1518','1.2.643.5.1.13.13.12.2.21.1563','1.2.643.5.1.13.13.12.2.21.1564','1.2.643.5.1.13.13.12.2.21.1556','1.2.643.5.1.13.13.12.2.21.1502','1.2.643.5.1.13.13.12.2.21.1505','1.2.643.5.1.13.13.12.2.21.1506','1.2.643.5.1.13.13.12.2.21.1509','1.2.643.5.1.13.13.12.2.21.1562','1.2.643.5.1.13.13.12.2.21.1555','1.2.643.5.1.13.13.12.2.21.1516','1.2.643.5.1.13.13.12.2.21.1559','1.2.643.5.1.13.13.12.2.21.10417'))  

WITH appointments AS (
  SELECT *
  FROM appointments_temp
  WHERE "oid" IN ('1.2.643.5.1.13.13.12.2.21.1514','1.2.643.5.1.13.13.12.2.21.1515','1.2.643.5.1.13.13.12.2.21.1518','1.2.643.5.1.13.13.12.2.21.1563','1.2.643.5.1.13.13.12.2.21.1564','1.2.643.5.1.13.13.12.2.21.1556','1.2.643.5.1.13.13.12.2.21.1502','1.2.643.5.1.13.13.12.2.21.1505','1.2.643.5.1.13.13.12.2.21.1506','1.2.643.5.1.13.13.12.2.21.1509','1.2.643.5.1.13.13.12.2.21.1562','1.2.643.5.1.13.13.12.2.21.1555','1.2.643.5.1.13.13.12.2.21.1516','1.2.643.5.1.13.13.12.2.21.1559','1.2.643.5.1.13.13.12.2.21.10417'))
, grouped AS (
  SELECT "from" "source"
    , count(*) total
    , count(*) FILTER (WHERE "start" BETWEEN '2022-01-01' AND '2022-12-05') total_0101_0512
    , count(*) FILTER (WHERE "start" BETWEEN '2022-01-01' AND '2022-11-07') total_0101_1107
    , count(*) FILTER (WHERE "start" BETWEEN '2022-11-08' AND '2022-11-14') total_1108_1114
    , count(*) FILTER (WHERE "start" BETWEEN '2022-11-15' AND '2022-11-21') total_1115_2111
    , count(*) FILTER (WHERE "start" BETWEEN '2022-11-22' AND '2022-11-28') total_1122_1128
    , count(*) FILTER (WHERE "start" BETWEEN '2022-11-29' AND '2022-12-05') total_1129_0512
  FROM appointments
  GROUP BY "source")
SELECT CASE 
         WHEN "source" = 'web' THEN 'ЕПГУ'
         WHEN "source" = 'reg' THEN 'Регистратура'
         WHEN "source" = 'kc' THEN 'Единый колл-центр субъекта РФ'
         WHEN "source" = 'kc-mo' THEN 'Колл-центр МО'
         WHEN "source" = 'doctor' THEN 'Врач'
         WHEN "source" = 'web-referral' THEN 'ЕПГУ (направления)'
         WHEN "source" = 'tmk-online' THEN 'По системе «врач-пациент»'
         WHEN "source" = 'fap' THEN 'ФАП'
         WHEN "source" = 'medNurse' THEN 'Медсестра'
       END
   , CASE WHEN (sum(total_0101_0512) OVER ()) = 0 THEN 0 ELSE round((total_0101_0512 / (sum(total_0101_0512) OVER ()) * 100), 2) END 
   , total_0101_0512
   , CASE WHEN (sum(total_0101_1107) OVER ()) = 0 THEN 0 ELSE round((total_0101_1107 / (sum(total_0101_1107) OVER ()) * 100), 2) END
   , total_0101_1107   
   , CASE WHEN (sum(total_1108_1114) OVER ()) = 0 THEN 0 ELSE round((total_1108_1114 / (sum(total_1108_1114) OVER ()) * 100), 2) END
   , total_1108_1114   
   , CASE WHEN (sum(total_1115_2111) OVER ()) = 0 THEN 0 ELSE round((total_1115_2111 / (sum(total_1115_2111) OVER ()) * 100), 2) END
   , total_1115_2111   
   , CASE WHEN (sum(total_1122_1128) OVER ()) = 0 THEN 0 ELSE round((total_1122_1128 / (sum(total_1122_1128) OVER ()) * 100), 2) END
   , total_1122_1128   
   , CASE WHEN (sum(total_1129_0512) OVER ()) = 0 THEN 0 ELSE round((total_1129_0512 / (sum(total_1129_0512) OVER ()) * 100), 2) END
   , total_1129_0512   
FROM grouped
ORDER BY array_position(array['web','reg','kc-mo','kc'], "source")

WITH appointments AS (
  SELECT *
  FROM appointments_temp_2
  WHERE "oid" IN ('1.2.643.5.1.13.13.12.2.21.1525.0.138194','1.2.643.5.1.13.13.12.2.21.1525.0.133590','1.2.643.5.1.13.13.12.2.21.1525.0.217012','1.2.643.5.1.13.13.12.2.21.1534.0.94875','1.2.643.5.1.13.13.12.2.21.1534.0.95731','1.2.643.5.1.13.13.12.2.21.1556.0.75666','1.2.643.5.1.13.13.12.2.21.1514.0.105884','1.2.643.5.1.13.13.12.2.21.1505.0.86619 ','1.2.643.5.1.13.13.12.2.21.1563.0.108254','1.2.643.5.1.13.13.12.2.21.1516.0.107664','1.2.643.5.1.13.13.12.2.21.1531.0.113590','1.2.643.5.1.13.13.12.2.21.1531.0.371682','1.2.643.5.1.13.13.12.2.21.1502.0.91570','1.2.643.5.1.13.13.12.2.21.1509.0.85728','1.2.643.5.1.13.13.12.2.21.1529.0.84540','1.2.643.5.1.13.13.12.2.21.1529.0.86519','1.2.643.5.1.13.13.12.2.21.1558.0.91831','1.2.643.5.1.13.13.12.2.21.1531.0.112838','1.2.643.5.1.13.13.12.2.21.1550.0.99123','1.2.643.5.1.13.13.12.2.21.1538.0.89487','1.2.643.5.1.13.13.12.2.21.1535.0.106932','1.2.643.5.1.13.13.12.2.21.1541.0.88460','1.2.643.5.1.13.13.12.2.21.1542.0.111436','1.2.643.5.1.13.13.12.2.21.1544.0.72362','1.2.643.5.1.13.13.12.2.21.1515.0.108694','1.2.643.5.1.13.13.12.2.21.1518.0.75379','1.2.643.5.1.13.13.12.2.21.1565.0.68991','1.2.643.5.1.13.13.12.2.21.1562.0.110709','1.2.643.5.1.13.13.12.2.21.1510.0.86450','1.2.643.5.1.13.13.12.2.21.1511.0.71866','1.2.643.5.1.13.13.12.2.21.1512.0.82541','1.2.643.5.1.13.13.12.2.21.1504.0.96242','1.2.643.5.1.13.13.12.2.21.1541.0.92194','1.2.643.5.1.13.13.12.2.21.1541.0.96371','1.2.643.5.1.13.13.12.2.21.1542.0.103529','1.2.643.5.1.13.13.12.2.21.1542.0.137160','1.2.643.5.1.13.13.12.2.21.1542.0.253753','1.2.643.5.1.13.13.12.2.21.1522.0.320039','1.2.643.5.1.13.13.12.2.21.1521.0.96376','1.2.643.5.1.13.13.12.2.21.1521.0.77641','1.2.643.5.1.13.13.12.2.21.1521.0.96385','1.2.643.5.1.13.13.12.2.21.1521.0.96394','1.2.643.5.1.13.13.12.2.21.1521.0.77798','1.2.643.5.1.13.13.12.2.21.1544.0.85293','1.2.643.5.1.13.13.12.2.21.1544.0.98163','1.2.643.5.1.13.13.12.2.21.1544.0.98271','1.2.643.5.1.13.13.12.2.21.1558.0.133425','1.2.643.5.1.13.13.12.2.21.1555.0.97744','1.2.643.5.1.13.13.12.2.21.1555.0.210693','1.2.643.5.1.13.13.12.2.21.1508.0.389946','1.2.643.5.1.13.13.12.2.21.1506.0.93889','1.2.643.5.1.13.13.12.2.21.1506.0.99372','1.2.643.5.1.13.13.12.2.21.1562.0.110419','1.2.643.5.1.13.13.12.2.21.1517.0.99457','1.2.643.5.1.13.13.12.2.21.1564.0.110271'))
, grouped AS (
  SELECT "from" "source"
    , count(*) total
    , count(*) FILTER (WHERE "start" BETWEEN '2022-01-01' AND '2022-12-05') total_0101_0512
    , count(*) FILTER (WHERE "start" BETWEEN '2022-01-01' AND '2022-11-07') total_0101_1107
    , count(*) FILTER (WHERE "start" BETWEEN '2022-11-08' AND '2022-11-14') total_1108_1114
    , count(*) FILTER (WHERE "start" BETWEEN '2022-11-15' AND '2022-11-21') total_1115_2111
    , count(*) FILTER (WHERE "start" BETWEEN '2022-11-22' AND '2022-11-28') total_1122_1128
    , count(*) FILTER (WHERE "start" BETWEEN '2022-11-29' AND '2022-12-05') total_1129_0512
  FROM appointments
  GROUP BY "source")
SELECT CASE 
         WHEN "source" = 'web' THEN 'ЕПГУ'
         WHEN "source" = 'reg' THEN 'Регистратура'
         WHEN "source" = 'kc' THEN 'Единый колл-центр субъекта РФ'
         WHEN "source" = 'kc-mo' THEN 'Колл-центр МО'
         WHEN "source" = 'doctor' THEN 'Врач'
         WHEN "source" = 'web-referral' THEN 'ЕПГУ (направления)'
         WHEN "source" = 'tmk-online' THEN 'По системе «врач-пациент»'
         WHEN "source" = 'fap' THEN 'ФАП'
         WHEN "source" = 'medNurse' THEN 'Медсестра'
       END
   , CASE WHEN (sum(total_0101_0512) OVER ()) = 0 THEN 0 ELSE round((total_0101_0512 / (sum(total_0101_0512) OVER ()) * 100), 2) END 
   , total_0101_0512
   , CASE WHEN (sum(total_0101_1107) OVER ()) = 0 THEN 0 ELSE round((total_0101_1107 / (sum(total_0101_1107) OVER ()) * 100), 2) END
   , total_0101_1107   
   , CASE WHEN (sum(total_1108_1114) OVER ()) = 0 THEN 0 ELSE round((total_1108_1114 / (sum(total_1108_1114) OVER ()) * 100), 2) END
   , total_1108_1114   
   , CASE WHEN (sum(total_1115_2111) OVER ()) = 0 THEN 0 ELSE round((total_1115_2111 / (sum(total_1115_2111) OVER ()) * 100), 2) END
   , total_1115_2111   
   , CASE WHEN (sum(total_1122_1128) OVER ()) = 0 THEN 0 ELSE round((total_1122_1128 / (sum(total_1122_1128) OVER ()) * 100), 2) END
   , total_1122_1128   
   , CASE WHEN (sum(total_1129_0512) OVER ()) = 0 THEN 0 ELSE round((total_1129_0512 / (sum(total_1129_0512) OVER ()) * 100), 2) END
   , total_1129_0512   
FROM grouped
ORDER BY array_position(array['web','reg','kc-mo','kc'], "source")

  